# Задача 2: Найдите сумму цифр трехзначного числа. 
# Например: 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = input('Введите трехзначное число: ')
print("Сумма чисел равна: ",int(a[0]) + int(a[1]) + int(a[2]))